Diagrams and Flowcharts updated for better visualisation and understanding
